# parameters
nc: 10  # number of classes
depth_multiple: 1.33  # model depth multiple
width_multiple: 1.25  # layer channel multiple

# anchors
#anchors:
#  - [10,13, 16,30, 33,23]  # P3/8
#  - [30,61, 62,45, 59,119]  # P4/16
#  - [116,90, 156,198, 373,326]  # P5/32
#anchors:
#  - [13.255,16.411, 20,24, 27.423,33.987, 35,40, 65.863,29.541, 90,45]  # P3/8
#  - [42.679,58.673, 60,95, 112.79,41.894, 160,60, 51.993,127.37, 75,180]  # P4/16
#  - [103.88,112.76, 150,165, 88.215,207.93, 135,300, 198.29,235.59, 300,335]  # P5/32
anchors:
  - [13.255,16.411, 27.423,33.987, 65.863,29.541]  # P3/8
  - [42.679,58.673, 112.79,41.894, 51.993,127.37]  # P4/16
  - [103.88,112.76, 88.215,207.93, 198.29,235.59]  # P5/32
#anchors:
#  - [11.785,14.048, 19.933,25.484, 53.065,30.144, 14.072,17.254, 27.118,32.289, 32.825,41.689]  # P3/8
#  - [30.004,74.811, 94.928,38.203, 53.392,134.13, 43.197,59.094, 57.86,76.741, 79.906,107.58]  # P4/16
#  - [98.619,74.012, 88.291,202.96, 248.98,167.96, 112.43,145.46, 155.06,217.33, 243.02,301.32]  # P5/32
# YOLOv5 backbone
backbone:
  # [from, number, module, args]
  [[-1, 1, Focus, [64, 3]],  # 0-P1/2
   [-1, 1, Conv, [128, 3, 2]],  # 1-P2/4
   [-1, 3, C3, [128]],
   [-1, 1, Conv, [256, 3, 2]],  # 3-P3/8
   [-1, 9, C3, [256]],
   [-1, 1, Conv, [512, 3, 2]],  # 5-P4/16
   [-1, 9, C3, [512]],
   [-1, 1, Conv, [1024, 3, 2]],  # 7-P5/32
   [-1, 1, SPP, [1024, [5, 9, 13]]],
   [-1, 3, C3, [1024, False]],  # 9
  ]

# YOLOv5 head
head:
  [[-1, 1, Conv, [512, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 6], 1, Concat, [1]],  # cat backbone P4
   [-1, 3, C3, [512, False]],  # 13

   [-1, 1, Conv, [256, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],
   [[-1, 4], 1, Concat, [1]],  # cat backbone P3
   [-1, 3, C3, [256, False]],  # 17 (P3/8-small)

   [-1, 1, Conv, [256, 3, 2]],
   [[-1, 14], 1, Concat, [1]],  # cat head P4
   [-1, 3, C3, [512, False]],  # 20 (P4/16-medium)

   [-1, 1, Conv, [512, 3, 2]],
   [[-1, 10], 1, Concat, [1]],  # cat head P5
   [-1, 3, C3, [1024, False]],  # 23 (P5/32-large)

   [[17, 20, 23], 1, Detect, [nc, anchors]],  # Detect(P3, P4, P5)
  ]
